garyPenhook/PyAvrOCD/svd/attiny3217.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VPORTC</name>
      <description>Virtual Ports</description>
      <baseAddress>0x00800008</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>Data Direction</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>IN</name>
          <description>Input Value</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>Pin Interrupt</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>Output Value</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VREF</name>
      <description>Voltage reference</description>
      <baseAddress>0x008000A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAC0REFSEL</name>
              <description>DAC0/AC0 reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0REFSEL</name>
              <description>ADC0 reference select</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAC0REFEN</name>
              <description>DAC0/AC0 reference enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0REFEN</name>
              <description>ADC0 reference enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC1REFEN</name>
              <description>DAC1/AC1 reference enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1REFEN</name>
              <description>ADC1 reference enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC2REFEN</name>
              <description>DAC2/AC2 reference enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAC1REFSEL</name>
              <description>DAC1/AC1 reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1REFSEL</name>
              <description>ADC1 reference select</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLD</name>
          <description>Control D</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DAC2REFSEL</name>
              <description>DAC2/AC2 reference select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V55</name>
                  <description>Voltage reference at 0.55V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>Voltage reference at 1.1V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>Voltage reference at 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V34</name>
                  <description>Voltage reference at 4.34V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V5</name>
                  <description>Voltage reference at 1.5V</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
